Revit 2026 API

# IExportContextOnFaceBegin Method

---

This method marks the beginning of a Face to be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
RenderNodeAction OnFaceBegin(
	FaceNode node
)
```
```vb
Function OnFaceBegin (
	node As FaceNode
) As RenderNodeAction
```
```cpp
RenderNodeAction OnFaceBegin(
	FaceNode^ node
)
```
```fsharp
abstract OnFaceBegin :
        node : FaceNode -> RenderNodeAction
```

#### Parameters

node FaceNode
     An output node that represents a Face.

#### Return Value

RenderNodeAction Return RenderNodeAction. Proceed if you wish to receive geometry (polymesh) for this face, or return RenderNodeAction.Skip otherwise.

Note that this method (as well as OnFaceEnd) is invoked only if the custom exporter was set up to include geometric objects in the output stream. See IncludeGeometricObjects for mode details.

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace